Repository: zviratko/omlx
Catalog: apps/omlx-mac/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# bench.context.result.verified
source: Verified prefill
zh_hans: 验证的预填充

# bench.context.row.model.label
source: Model
zh_hans: 模型

# bench.context.row.model.sub
source: Loaded or unloaded — server will load on demand
zh_hans: 已加载或未加载 — 服务器将按需加载

# bench.context.row.priority.label
source: Prefill Priority
zh_hans: 预填充优先级

# bench.context.row.priority.sub
source: Mirrors the global setting and saves immediately — serving uses the same mode, so the measured value stays valid
zh_hans: 镜像全局设置并立即保存 — 服务使用相同模式，因此测量值保持有效

# bench.context.row.target.label
source: Maximum context to test
zh_hans: 要测试的最大上下文

# bench.context.row.target.sub
source: The search stops at this size; larger targets take longer to verify
zh_hans: 搜索在此大小处停止；更大的目标需要更长时间验证

# bench.context.section.configuration
source: Configuration
zh_hans: 配置

# bench.context.section.result
source: Result
zh_hans: 结果

# bench.context.subtitle.loading_models
source: Loading models…
zh_hans: 加载模型中…

# bench.context.subtitle.model_count
source: Models available: %lld
zh_hans: 可用模型：%lld

# bench.context.warning.body
source: This benchmark can take a long time — verification prefills a real prompt at the measured size, which may take many minutes for large models. All loaded models are unloaded when it starts, interrupting active requests. When it finishes, the result is automatically applied to the model's Context Window setting.
zh_hans: 此基准测试可能需要很长时间 — 验证会在测量大小处预填充真实提示，对于大型模型可能需要很多分钟。开始时所有已加载的模型都会被卸载，中断活动请求。完成后，结果会自动应用到模型的上下文窗口设置。

# bench.context.warning.title
source: Before you start
zh_hans: 开始之前

# bench.throughput.batch.col.pp_tps
source: pp TPS
zh_hans: 提示词处理 TPS

# bench.throughput.batch.col.tg_tps
source: tg TPS
zh_hans: 生成 TPS

# bench.throughput.context.code_mixed
source: Code (Mixed)
zh_hans: 代码（混合）

# bench.throughput.context.code_python
source: Code (Python)
zh_hans: 代码（Python）

# bench.throughput.context.novel_en
source: Novel (English)
zh_hans: 小说（英语）

# bench.throughput.context.novel_ja
source: Novel (Japanese)
zh_hans: 小说（日语）

# bench.throughput.context.novel_ko
source: Novel (Korean)
zh_hans: 小说（韩语）

# bench.throughput.row.context.label
source: Benchmark Context
zh_hans: 基准测试上下文

# bench.throughput.row.context.sub
source: It only affects results when acceleration features such as MTP or DFlash are enabled.
zh_hans: 仅在启用加速功能（如 MTP 或 DFlash）时影响结果。

# bench.throughput.single.col.pp_tps
source: pp TPS
zh_hans: 提示词处理 TPS

# bench.throughput.single.col.tg_tps
source: tg TPS
zh_hans: 生成 TPS

# bench.throughput.single.col.ttft
source: TTFT (ms)
zh_hans: TTFT（毫秒）

# downloads.source.ms
source: ModelScope
zh_hans: 魔搭社区

# performance.memory.placeholder_auto
source: auto
zh_hans: 自动

# performance.scheduler.prefill_priority
source: Prefill Priority
zh_hans: 预填充优先级

# performance.scheduler.prefill_priority.sub
source: Max Context trades prefill speed for larger prompts under memory pressure; Speed keeps full prefill speed and rejects prompts that would not fit.
zh_hans: 最大上下文在内存压力下以预填充速度换取更大的提示；速度保持完整预填充速度并拒绝不适合的提示。

# prefill_priority.option.max_context
source: Max Context
zh_hans: 最大上下文

# prefill_priority.option.speed
source: Speed
zh_hans: 速度

# profile.detail.templates.reasoning_parser
source: Reasoning · %@
zh_hans: 推理 · %@

# profile.save_as.name.placeholder
source: profile-name
zh_hans: 配置文件名

# settings.advanced.chat_template.count
source: kwargs: %lld
zh_hans: 参数：%lld

# settings.advanced.chat_template.type.custom
source: CUSTOM
zh_hans: 自定义

# settings.advanced.chat_template.type.enable_thinking
source: ENABLE_THINKING
zh_hans: 启用思考

# settings.advanced.chat_template.type.reasoning_effort
source: REASONING_EFFORT
zh_hans: 推理强度

# settings.advanced.qwen4_ssd_offload.forced
source: Required because resident loading exceeds the configured model-memory limit.
zh_hans: 必需，因为常驻加载超出了配置的模型内存上限。

# settings.advanced.qwen4_ssd_offload.label
source: SSD N-gram Offload (Qwen4 only)
zh_hans: SSD N-gram 卸载（仅 Qwen4）

# settings.advanced.qwen4_ssd_offload.sub
source: Keep the PLE N-gram table on SSD to save memory. Prefill can be slower after context changes.
zh_hans: 将 PLE N-gram 表保留在 SSD 上以节省内存。上下文变化后预填充可能变慢。

# settings.model_type.audio_sts
source: Audio STS
zh_hans: 音频 STS

# settings.model_type.audio_stt
source: Audio STT
zh_hans: 音频 STT

# settings.model_type.audio_tts
source: Audio TTS
zh_hans: 音频 TTS

# status.runtime_cache.observability
source: Runtime Cache Observability
zh_hans: 运行时缓存可观测性

# status.runtime_cache.tier_memory
source: Memory
zh_hans: RAM 缓存

# status.runtime_cache.tier_ssd
source: SSD
zh_hans: SSD 缓存

# status.runtime_cache.clear_memory_tooltip
source: Clear memory cache
zh_hans: 清除 RAM 缓存

# status.runtime_cache.clear_memory_confirm
source: Clear memory cache?
zh_hans: 清除 RAM 缓存？

# status.runtime_cache.active_base_path
source: Active base_path
zh_hans: 活动 base_path

# status.runtime_cache.effective_ssd_dir
source: Effective ssd_cache_dir
zh_hans: 生效 ssd_cache_dir

# status.runtime_cache.response_state_dir
source: response-state directory
zh_hans: 响应状态目录

# status.runtime_cache.prefix_hit_rate
source: Prefix Hit Rate
zh_hans: 前缀命中率

# status.runtime_cache.memory_hit_rate
source: Memory Hit Rate
zh_hans: RAM 命中率

# status.runtime_cache.prefix_evictions
source: Prefix Evictions
zh_hans: 前缀驱逐

# status.runtime_cache.memory_evictions
source: Memory Evictions
zh_hans: RAM 驱逐

# status.runtime_cache.col_model
source: Model
zh_hans: 模型

# status.runtime_cache.col_block_size
source: Block Size
zh_hans: 块大小

# status.runtime_cache.col_indexed_blocks
source: Indexed Blocks
zh_hans: 索引块数

# status.runtime_cache.col_subblock_cache
source: Sub-block Cache
zh_hans: 子块缓存

# status.runtime_cache.col_ssd_files
source: SSD Files
zh_hans: SSD 文件数

# status.runtime_cache.col_ssd_size
source: SSD Size
zh_hans: SSD 大小

# status.runtime_cache.col_memory_entries
source: Memory Entries
zh_hans: RAM 条目

# status.runtime_cache.col_memory_size
source: Memory Size
zh_hans: RAM 大小

# status.runtime_cache.subblock_note
source: Note: Sub-block Cache means requests below one full block (for example <1024 tokens on some models) are cached in memory/paged cache but are not counted as indexed SSD blocks.
zh_hans: 注：子块缓存指未达一个完整块的请求（例如某些模型上 <1024 Token）被缓存在 RAM/分页缓存中，但不计入已索引的 SSD 块。
